### Planned Changes to Server Infrastructure
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `failure`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.server.random_password.password: Refreshing state... [id=none]
random_string.resource_code: Refreshing state... [id=ffytqqs4]
github_repository_environment.this: Refreshing state... [id=indok-api:production]
module.server.data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Reading...
module.server.data.azurerm_key_vault_secret.postman_api_token: Reading...
module.server.data.azurerm_key_vault_secret.feide_client_secret: Reading...
module.server.module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
module.server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
module.server.module.database.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Network/privateDnsZones/production-ffytqqs4.postgres.database.azure.com]
module.server.module.managed_identity.azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.ManagedIdentity/userAssignedIdentities/managed-identity-ffytqqs4]
module.server.module.redis.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net]
module.server.module.container_app_environment.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.OperationalInsights/workspaces/ca-log-workspace-ffytqqs4]
module.server.module.redis.azurerm_redis_cache.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Cache/redis/redisffytqqs4]
module.server.module.vnet.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Network/virtualNetworks/vnet-ffytqqs4]
module.server.azurerm_role_assignment.rg_reader: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Authorization/roleAssignments/f407a3a6-374f-18f6-7ada-6219c92b7d82]
module.server.module.key_vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.KeyVault/vaults/key-vault-ffytqqs4]
module.server.azurerm_role_assignment.key_vault_user: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Authorization/roleAssignments/44b7cc50-4011-bc59-f4ce-305d00ea8a66]
module.server.module.container_app_environment.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Network/virtualNetworks/vnet-ffytqqs4/subnets/ca-subnet-ffytqqs4]
module.server.module.redis.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Network/virtualNetworks/vnet-ffytqqs4/subnets/redis-subnet-ffytqqs4]
module.server.module.database.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Network/privateDnsZones/production-ffytqqs4.postgres.database.azure.com/virtualNetworkLinks/pg-ffytqqs4.com]
module.server.module.database.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Network/virtualNetworks/vnet-ffytqqs4/subnets/pg-subnet-ffytqqs4]
module.server.module.redis.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net/virtualNetworkLinks/vnet-private-zone-link]
module.server.data.azurerm_key_vault_secret.feide_client_secret: Read complete after 2s [id=https://shared-key-vault-altht.vault.azure.net/secrets/feide-client-secret/299f08ebe57941dda63f30a792037af0]
module.server.module.database.azurerm_postgresql_flexible_server.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-fs-ffytqqs4]
module.server.module.container_app_environment.azurerm_container_app_environment.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.App/managedEnvironments/ca-env-ffytqqs4]
module.server.azurerm_key_vault_secret.db_connection_string: Refreshing state... [id=https://key-vault-ffytqqs4.vault.azure.net/secrets/db-connection-string/1c21f908b6d44988b27367ac49e1974a]
module.server.module.database.azurerm_postgresql_flexible_server_database.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-fs-ffytqqs4/databases/pg-fs-db-ffytqqs4]
module.server.azurerm_key_vault_secret.redis_connection_string: Refreshing state... [id=https://key-vault-ffytqqs4.vault.azure.net/secrets/redis-connection-string/c0a00781d7254b619421e207b2109713]
module.server.module.redis.azurerm_private_endpoint.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.Network/privateEndpoints/endpoint-ffytqqs4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.server.azurerm_key_vault_secret.session_secret will be created
  + resource "azurerm_key_vault_secret" "session_secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-ffytqqs4/providers/Microsoft.KeyVault/vaults/key-vault-ffytqqs4"
      + name                    = "session-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.server.random_password.session_secret_value will be created
  + resource "random_password" "session_secret_value" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @larwaa, Action: `pull_request`*